In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],index=["a", "b", "c", "d"],columns=["one", "two"])

In [3]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [4]:
df.sum()    # 调用DataFrame的sum方法会返回包含列之和的Series

one    9.25
two   -5.80
dtype: float64

In [5]:
df.sum(axis="columns")    # 传入axis="columns"或axis=1会对各行进行跨列求和运算

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [6]:
df.sum(axis="index", skipna=False)    
# 如果某行或某列全为NA值，则和为0。但如果既有NA值也有非NA值，则会自动跳过NA值。如果不想跳过，可以通过skipna选项设置。如果某行或某列有NA值，则结果就是NA值

one   NaN
two   NaN
dtype: float64

In [7]:
df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [8]:
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

# 约简方法的常用选项如下表
| 方法 | 说明 |
|-------|-------|
| axis | 约简的轴，DataFrame的行用’index‘，列用’columns‘ |
| skipna | 排除缺失值，默认为True |
| level | 如果轴是层次化索引的（即MultiIndex），则根据level分组约简 |

In [9]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

### 计算最小值的索引标签

In [10]:
df.idxmax()

one    b
two    d
dtype: object

### 所有值的累计和

In [11]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

### 计算汇总统计信息

In [12]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [13]:
obj = pd.Series(["a", "a", "b", "c"] * 4)

### 计算汇总统计信息

In [14]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

# 描述性统计和汇总统计
| 方法 | 说明 |
|-------|-------|
| count | 非 NA 值的数量 |
| describe | 计算汇总统计信息 |
| min、max | 计算最小值和最大值 |
| argmin、argmax | 计算最小值和最大值的索引位置(整数);在DataFrame对象上不可用 |
| idxmin、idxmax | 计算最小值和最大值的索引标签 |
| quantile | 计算样本 0~1之间的分位数(默认为0.5) |
| sum | 所有值的总和 |
| mean | 所有值的平均数 |
| median | 所有值的算术中位数(50%分位数) |
| mad | 平均值的平均绝对偏差 |
| var | 所有值的样本方差 |
| std | 所有值的样本标准差 |
| skew | 所有值的样本偏度(三阶矩) |
| kurt | 所有值的样本峰度(四阶矩) |
| cumsum | 所有值的累计和 |
| cummin、cummax | 所有值的累计最小值和累计最大值 |
| cumprod | 所有值的累计积 |
| diff | 计算一阶差分(对时间序列很有用) |
| pct_change | 计算百分比变化 |

In [15]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [16]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

### 所有值的累计积

In [17]:
df.cumprod()

     one   two
a  1.400   NaN
b  9.940 -4.50
c    NaN   NaN
d  7.455  5.85

### 计算百分比变化

In [18]:
df.pct_change(fill_method=None)

        one  two
a       NaN  NaN
b  4.071429  NaN
c       NaN  NaN
d       NaN  NaN

In [19]:
df1 = pd.DataFrame({
    'A': [100, 105, 110, 115, 120],
    'B': [200, 195, 210, 215, 230]
})

df1['A_pct_change'] = df1['A'].pct_change()
df1['B_pct_change'] = df1['B'].pct_change()

In [20]:
df1

     A    B  A_pct_change  B_pct_change
0  100  200           NaN           NaN
1  105  195      0.050000     -0.025000
2  110  210      0.047619      0.076923
3  115  215      0.045455      0.023810
4  120  230      0.043478      0.069767

## 相关系数与协方差

In [21]:
price = pd.read_pickle("examples/yahoo_price.pkl")

In [22]:
volume = pd.read_pickle("examples/yahoo_volume.pkl")

In [23]:
returns = price.pct_change()

In [24]:
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [25]:
price.pct_change()

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [26]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [60]:
volume.tail()

                AAPL     GOOG       IBM      MSFT
Date
2016-10-17  23624900  1089500   5890400  23830000
2016-10-18  24553500  1995600  12770600  19149500
2016-10-19  20034600   116600   4632900  22878400
2016-10-20  24125800  1734200   4023100  49455600
2016-10-21  22384800  1260500   4401900  79974200

In [27]:
returns["MSFT"].corr(returns["IBM"])

np.float64(0.4997636114415114)

In [28]:
returns["MSFT"].cov(returns["IBM"])

np.float64(8.870655479703546e-05)

In [29]:
returns[['MSFT', 'IBM']].std()

MSFT    0.014667
IBM     0.012102
dtype: float64

In [30]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [31]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

### 计算标准差

In [32]:
returns.std()

AAPL    0.016641
GOOG    0.015830
IBM     0.012102
MSFT    0.014667
dtype: float64

### 计算 DataFrame 中每列与给定序列（在本例中为"IBM"列）的相关性。

In [33]:
returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [34]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

# 唯一值、计数以及成员属性`obj.unique()`、`obj.value_counts()`、`obj.isin(值列表)`

### 计算Series中的唯一值数组，按发现的顺序返回

In [35]:
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

In [36]:
uniques = obj.unique()

In [37]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

### 降序排序    `uniques.sort()`、`np.sort(uniques)`

In [38]:
uniques.sort()

In [39]:
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [40]:
np.sort(uniques)

array(['a', 'b', 'c', 'd'], dtype=object)

### 返回一个Series，唯一值作为索引，频次作为值，默认频次按降序排列    `pd.value_counts(obj.to_numpy(), sort=False)`、`obj.value_counts()`

In [41]:
# pd.value_counts(obj.to_numpy(), sort=False)    # 顶级方法，未来可能会过期

In [42]:
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

### 计算表示Series各值是否包含于传入序列，返回布尔型数组

In [43]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [44]:
mask = obj.isin(["b", "c"])

In [45]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [46]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

### 计算数组中的各值到另一个唯一值数组的整数索引，对于数据对齐和连接类型的操作十分有用

In [47]:
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])

In [48]:
unique_vals = pd.Series(["c", "b", "a"])

In [49]:
indices = pd.Index(unique_vals).get_indexer(to_match)

In [50]:
# pd.Index(unique_vals)根据唯一值创建索引，.get_indexer(to_match)返回一个整数数组，表示to_match的每个元素在unique_vals索引中的位置。

In [51]:
indices

array([0, 2, 1, 1, 0, 2])

# 唯一值、计数、成员属性方法如下表
| 方法 | 说明 |
|-------|-------|
| isin | 计算表示Series各值是否包含于传入序列，返回布尔型数组 |
| get_indexer | 计算数组中的各值到另一个唯一值数组的整数索引，对于数据对齐和连接类型的操作十分有用 |
| unique | 计算Series中的唯一值数组，按发现的顺序返回 |
| value_counts | 返回一个Series，唯一值作为索引，频次作为值，频次按降序排列 |

In [52]:
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],"Qu2": [2, 3, 1, 2, 3],"Qu3": [1, 5, 2, 4, 4]})

In [53]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

### 计算其中一列的计数

In [54]:
data["Qu1"].value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

### 计算所有列的计数，结果中的行标签是所有列的不同值，结果的值是每列中不同值的相应计数。

In [55]:
result = data.apply(pd.value_counts).fillna(0)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_5876\2451317050.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  result = data.apply(pd.value_counts).fillna(0)

In [56]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

### 将DataFrame的每行当作元组，计算不同行的计数

In [57]:
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})

In [58]:
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [59]:
data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64